[
  {
    "id": "1",
    "title": "3 years of happiness",
    "date": "",
    "description": "memories\nmeans of this diary what all I have preserved and captured through my mind in the last 3 years, and how much I adore us to remember our little cute details.\nI decided to show you what you mean to me through this diary. I hope you'll like it\n\nDedicated to Aryan",
    "isHighlight": false
  },
  {
    "id": "7",
    "title": "Another fight, and another I love You",
    "date": "",
    "description": "Why do we have our important firsts happening during a fight only? Do you remember this one, I got insanely jealous of Ritika (because you shared with me a video where you played with her hair). The distance was already making it hard, and then I see something I want between you and me happening between you and Ritika. I am sorry, I was insanely jealous because I loved you so much back then also null. This was the day I said I love you to you for the very first time, even though I wanted to wait and say this to you offline first, I just couldn't",
    "isHighlight": false
  },
  {
    "id": "11",
    "title": "Our first date night",
    "date": "",
    "description": "null Nov 2021\n\nMajors are finally over YAYYY... Now we can have our first date night after being on campus! Let's go to cyberhub..",
    "isHighlight": false
  },
  {
    "id": "12",
    "title": "Sometime later:",
    "date": "",
    "description": "Cyberhub aa toh gye par sab itna mehnga hai kya khaye? Pura cyberhub ghumke, hum gye Tacobell (my first time trying something new with you)\n\nWhy tacobell? Kyunki uss se zyada kisi place ko afford karne jitna humara budget hi nhi tha\n\nFir humne cuberhub ke steel tables and artificial grass vali location pe bahut saari photos li, to just get that one perfect picture of us.. Totally worth it",
    "isHighlight": false
  },
  {
    "id": "13",
    "title": "First Photoshoot",
    "date": "",
    "description": "null January 2022\n\nWe clicked so many pictures this day! You were about to leave for Pune, and the plan was for me to drop you till the railway station. But before you went, we actually did our photoshoot near the Zanskar swing, we took a million photos, all\nare my fav..\n\n\nIsn't this one of the cutest??",
    "isHighlight": false
  },
  {
    "id": "14",
    "title": "Bye Delhi, Hello Pune",
    "date": "",
    "description": "null January 2022\n\nI was so sad, the first time you were leaving Delhi to go to Pune (I mean the first time both of us were on campus). I cried feeling so alone on my way back... do u remember I sent you pics of me crying? (2) This is still my face every time you leave for your home, Even though I don't' cry that much now its only because I\nhave gotten better at hiding those sadness emotions from you, but every time you leave, I still feel the same.\n\nAlso, sorry for the COVID I gave you (ps: and your whole family too and all those people on the train lol, pps: do u remember the cookies?)",
    "isHighlight": false
  },
  {
    "id": "15",
    "title": "First anniversary!",
    "date": "",
    "description": "null March 2022\n\nYou made my day a million times better by deciding to make it to campus on the day of our anniversary. We had gone back to our homes since COVID had arrived with another new wave (ps: along with ourselves, we also brought covid to our homes but that's a different story)\nEven though yiu were very busy and had an assignment deadline the very same day, you still made it to campus and decided to have dinner woth me. We ordered Taco Bell (it became my new favourite ever since the first time I had it with you) I loved picking you up from the airport. This was the second time I was picking you up, but I was very excited (so much that I borrowed new clothes from Smrati so that I could look extra good for you)\n\nYou brought me a packet of bhakarwadi also which I bhasmed very soon.. Tysm!!\nPs: don't have a picture of us since you were busy with assignment but here is a picture of the day we were coming back from the airport",
    "isHighlight": false
  },
  {
    "id": "16",
    "title": "When Aaru took me to AIIMS",
    "date": "",
    "description": "null March 2022\n\nDo you know, I have a whole message written down for this date, which gives an account of all the events that happened on this day. You were sick and vomiting. Oh wait, let me copy paste the exact message that I wrote 2 years ago here.\n\n\nThis is another saved message I have. I was so touched that day, you were sick, you deserved the care and attention, but guess who got it? Prissy. You have always put me first; I can never thank God enough that I got you. I have never doubted for a second that you'll ever fail to take care of me. I love you so much aaru...",
    "isHighlight": false
  },
  {
    "id": "17",
    "title": "First time you came home..",
    "date": "",
    "description": "null March 2022\n\nAfter my leg got hurt, you and Smrati came to my house to surprise me, I guess that was your first ever visit to my house. I was so happy to see you both! You also got me chocolate and flowers. I know, it was you who wanted to visit me at my home, but you couldn't do so without raising a suspicion if you came alone, so you\nbrought her as well.. and I also remember the 2 of null doing bakchodi in a room and me trying to say to you guys \" mumma dekh lengi band karo\"\n\nPs: ussi din Max Planck ka bhi intvw tha mera and I had called u to vc with me for 2 mins and then again got angry since u didn't pick it up (coz u were on ur way here). Stupid me.\n\nPps: I'm writing this on null March 2024, exactly 2 years later..",
    "isHighlight": false
  },
  {
    "id": "18",
    "title": "Cyberhub Date",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "20",
    "title": "First festival together: Holi",
    "date": "",
    "description": "null March 2022\n\nI tried to surprise you this day by telling you that I wasn't gonna be on campus for the festival when my plan all along was to come and surprise null and say happy holi and put lots of colour on your face\n\nLol do u remember how someone made a meme out of us that was very vulgar? (something like Pornhub)",
    "isHighlight": false
  },
  {
    "id": "21",
    "title": "Happy birthday Aaru!!",
    "date": "",
    "description": "null March 2022\n\nYour first birthday offline with me.. I was confused kya karu tere liye, should I invite friends for celebration, or what. I ultimately got u my favourite cupcakes and we had our own private celebration. It was nice no?\n\nSorry I got upset over the lunch you had with your friends null",
    "isHighlight": false
  },
  {
    "id": "22",
    "title": "Dance at RDV with Aaru",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "24",
    "title": "Your internship offer!!",
    "date": "",
    "description": "null May 2022\n\nYou remember after I got my foreign internship, we both were sending mails for your internship opportunity. I remember I was praying internally so much after your interview that pls god isko ye vali opportunity mil jaye, bcoz then we would both get to travel Germany together! At that point all this seemed to good to ever be able to come true, but it did and OMG I was so so so happy that day!\n\nPs: I intentionally sent more mails to German universities than any other countries' universities null",
    "isHighlight": false
  },
  {
    "id": "25",
    "title": "Update on Internship Offer",
    "date": "",
    "description": "From Woodstock, Zev Cohen <woodstock@zib.de> on 03-05-2022 18:34\nDetails 回 Plain text 等 Light\n\nDear Aryan,\n\nWe have decided that we would like to offer you an internship position for this summer. However, due to a budget freeze in the Berlin Senate, the funding for June is still uncertain. We are trying to figure out if we can unlock some funds and will hopefully have a definitive answer in the next few days.\n\nBest,\nZev\n\nCAUTION: This email originated from outside of IIT Delhi. Do not click links or open attachments unless you recognize the sender and know the content is safe.\nStill remember your resistance in going to our first hotel (1). But I still am so happy we went; this was the first time we cuddled each other and slept in each other's arms. I loved seeing you asleep, you looked like a small cute little baby, and watching you sleep was so calm and beautiful. Mera man karta hai roz subah tujhe huggie karke sirf mein hi uthau",
    "isHighlight": false
  },
  {
    "id": "26",
    "title": "Becoming your family",
    "date": "",
    "description": "I know this is a really small one, but to me it was very significant, that's why I have it as a saved message. You said to me \"Gn family null \" and also included me in your family pic and sent it to me. Thanks for making me your family. You and I are a family till the end... I LOVE YOU",
    "isHighlight": false
  },
  {
    "id": "27",
    "title": "First international trip together",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "29",
    "title": "The last one in Germany (1) ...",
    "date": "",
    "description": "null July 2022\n\nWe were coming back from our trip to Munich, and I was so sad when it was the tome to say goodbye. The last two months had been just like a dream: it felt a little like our honeymoon: going to places together, staying in the same hotel, outings, food, exploring culture etc\n\nWe parted our ways at the station (after all the drama of having lost my keys, us waiting for the hardware store to open, meanwhile us going to the police station to get my bag opened, and that afghani person saying for our lock \"asli hai\")\n\nWhat an adventure no? Feel like all major ups and downs of all my life have been with you and only you\n\nHere is a picture of us parting at the railway station (but wait, was it really the last time? Haha)\n\n\nPs: I'm sad, don't want this to end..",
    "isHighlight": false
  },
  {
    "id": "30",
    "title": "The last one in Germany (2) ...",
    "date": "",
    "description": "26 null July 2022\n\nWe had a huge fight the day before, I got super angry. But you made all sorts of efforts to come meet me in Gottingen. Showing up at my door at 3am at night scared me enough, but seeing you at the door, I remember, I forgot everything instantly and just hugged you. You are right, we should resolve fights by meeting physically. All that anger just goes away..\n\nI wish you had stayed a little longer though, like just one extra day. But you had your Optiver tests going on so I had to let you go, otherwise I would have held u so tightly in my arms that you could never leave.\n\n\nPs: Thank you for preserving my hair from Gottingen",
    "isHighlight": false
  },
  {
    "id": "31",
    "title": "First barbeque",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "33",
    "title": "Proposal",
    "date": "",
    "description": "So I had been going on and on about how I never got a formal proposal from you null You made me such a cute proposal (my noob baby used his ipad tech to draw a rose for me).. Kya kare fir, anniversary date change karde?\n\nDo you remember, iss se ek din pehle bhi ek fight ho rhi thi humari. All are cute important moments have come after a fight only (lol)",
    "isHighlight": false
  },
  {
    "id": "34",
    "title": "Rose day",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "36",
    "title": "Murthal",
    "date": "",
    "description": "Our first time where I sat in the passenger seat and you were driving; also the first time I saw you driving in real life. Aisa nhi hai I did not enjoy the trip, I did, it's only that I enjoy trips more if they are just you and me alone. But I remember uske baad we went to Cyberhub on our first Chilli's date where we ate loaded nachos and a bunch of other things. Fir fast fast drive karke zoom car chodke bhi toh aana tha.\n\nSo ig, our first trip together outside of Delhi (excluding things like Cyberhub in Gurgaon) can be taken as Murthal right?",
    "isHighlight": false
  },
  {
    "id": "37",
    "title": "Manali Trip",
    "date": "",
    "description": "null Jan 2023\n\nI started my new year's the perfect way: with you 2 ? This was our first college trip together and I enjoyed it a lot. My New Year's Eve, the midnight moment, the new year's day, all was spent right: with you\n\nYou remember the cute photoshoot we had with that guy while we were just roaming alone near the river? And how much money he was initially asking for each photo but later agreed to give us all for some amount which was very less compared to what he had offered earlier?",
    "isHighlight": false
  },
  {
    "id": "38",
    "title": "My Billu",
    "date": "",
    "description": "Without a doubt, you know this is the BESTEST GIFT ANYONE HAS EVER GIVEN ME. I huggie that cat so much.. whenever I feel low or down, or we have a fight and I miss you, I just hug it thinking its you and cry and cry and cry. My cat is the best thing you have given me as a gift!!\n\nI love it so so much aaru, tysm for bringing billu into my life null (1)\nPs: you're also my billu.. remember when I said meri cat ka birthday aa rha hai and you thought its you who's birthday is being talked about? I love you and your cuteness null\n\n\nMy two favorite cats null\nPicture taken the day we went to our first AIR BNB ( null Feb) and you helped me get my internship at Uber, can't thank you enough. Whatever I have today is all because of you. Thank you for helping me with my Uber test null (2)",
    "isHighlight": false
  },
  {
    "id": "39",
    "title": "null Avenue: Valentine's edition",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "41",
    "title": "Cooking together for the first time",
    "date": "",
    "description": "null Feb 2023\n\nWhen we went to our first AIR BNB, we decided to cook together. Fir humne liye bahut saare pyaaz tamatar and capsicum, aur hum ho gye shuru pizza banane. Base pe sab kuch laga liya, hmmm looks yum, now lets put it on the pan to cook it.\n\nNice the cheese has started to melt, it looks osum, lets lift it off the tawa.. AAAAH WTF YE TOH JAL GYA NEECHE SE null\n\n\n\nThe first meal we cooked together\nNvm pizza, bhelpuri banayenge. No cooking needed!!\nChalo ye toh theek bani",
    "isHighlight": false
  },
  {
    "id": "42",
    "title": "Kaizen with you",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "44",
    "title": "First cream stone ice-cream",
    "date": "",
    "description": "null April 2023\n\nAnother thing I tried with you for the first time. I hadn't known of making ice creams by mixing earlier. We went to cp for our date and then went to this creamstone outlet. The icecream was yum null\n\nAnd after that pata nhi kya hua, the store just closed. Sad we couldn't ever enjoy another ice-cream there.",
    "isHighlight": false
  },
  {
    "id": "45",
    "title": "Bangalore surprise!",
    "date": "",
    "description": "null June 2023\n\nYou don't fail to surprise me ever. Talking to me from Smrati's telegram account, pretending to be Smrati, tricking me into coming to the mall. I didn't anticipate thoda sab hi that this all could be a surprise! Well planned.\n\nU remember the face and the expression I had when I actually realized it was you? The look I gave while we were on that escalator.\n\nYou had already ordered what I liked the most : a sizzler. Although we had to eat it very fast and got very little time together, but we had many Bangalore dates after that no? So we can add Bangalore to the list of cities we have already explored together",
    "isHighlight": false
  },
  {
    "id": "46",
    "title": "A cute evening in Bangalore...",
    "date": "",
    "description": "null July 2023\n\nThis day we had a fight and you came all the way from your home to my PG just to manao me. Thank you so much, kaha hi milega mujhe koi itna manane vala kabhi\n\nYou got a rose for me as well. I kept that rose and carried it with me till Delhi because I just couldn't leave it behind, it felt like leaving you behind.\n\nYaha pe bhi foodie vali harkate hi ki humne, Gola sizzler, kabhi Polar bear, kabhi Golgappe, kabhi Sarjapura social. Bas khaate rehte hai hum\n\nThe picture below is my favourite: I'm resting peacefully in your arms, safe and secure, at rest.",
    "isHighlight": false
  },
  {
    "id": "47",
    "title": "Everything I do, I do it for you..",
    "date": "",
    "description": "null July 2023\n\nThis day, we were having some fight and you dedicated this song for me. You said, mene bachpan mein ek gaana yaad kiya tha, sunau? I said yes. Then you yourself wrote down the lyrics of the song for me and dedicated it to me. Thank you, it was very cute null\n\nLook into my eyesse 23:52\nYou will seee 23:52\nWhat 23:52\nYou mean 23:52\nToooo meee 23:52\nSearch your heart 23:53\nSearch your soall 23:53\nAnd when u find me theree 23:53\nYoull searchhhh no more 23:53\nDont tell me, its not worth trying forrrr 23:53\nYou cant tell me, its not worth fighting forrrr 23:53\n\nYou know its true..... 23:53\nEverything i do.... 23:54\nI do it for you 23:54\nLook into my heartttt 23:54",
    "isHighlight": false
  },
  {
    "id": "48",
    "title": "Intern season",
    "date": "",
    "description": "null Aug 2023\n\nI am sorry, I made you leave optiver. When I think about this day, ultimately, I feel sad and sad only. What I wanted was for you to feel the same for me: the \"not wanna go away to another country without you\" feeling and the \"If she is so uncomfortable with it, I can leave an internship for her \" feeling, but I understood this later, that I can't induce it in you. The result of me asking you to not go there was nothing but all negative: what you feel about me hasn't changed, I know, career is and was and will be your priority (and that's okay, I am lucky to have an independent thinking guy who is so focused that he'll be successful in the future without a doubt). All I got by this incident was you feeling sad, which I didn't want. Ultimately none of us were happy, you didn't get what you wanted (the internship), I didn't get what I wanted (you feeling the same way about me as I did). We both lost, and I am so sorry, I shouldn't have asked you to not go for Optiver. I am sorry Aaru, I am sorry you could land just Quadeye which you are still unsatisfied with. I am sorry you feel this way about your career options. I am sorry for this day. I should've realized what this meant to you when you agreed to leave me for Optiver, I should've told myself that Prisha if you love him, you'll let him do what he wants the most. I am sorry, I got selfish. I tried to get what comes from a person naturally by forcing you to choose between me and Optiver. It wasn't right, I shouldn't have stopped you from going for it, because today you left one thing for me which you loved the most, tomorrow you're gonna hate me for making you leave it. I don't want you to ever hate me, so I won't ever stop you from doing anything you like.\n\nThat's why, at the end of the memories section of this Journal, you'll find in the promises section a promise which will say that I'll never ever stop you from doing anything you like even if it hurts me, I'll never try to stop you by blackmailing you. I am sorry for being this dark day in your life.",
    "isHighlight": false
  },
  {
    "id": "49",
    "title": "First Starbucks Date",
    "date": "",
    "description": "Ye party bhi tune hi di thi. Vese toh hum null Sept ko jaane vale the, but then kuch misunderstanding ho gyi thi humare beech and you thought I didn't wanna go when it was nothing like that. So we went to starbucks the next day and pretended to be rich people who order and drink Venti with vanilla icecream..\n\nOh, the vanilla icecream, remember the starbucks hoping we did inorder to just find a café that has the vanilla icecream? You wanted to give me the best experience of that drink.\n\nAgain, this is another thing I tried with you only for the very first time. My first starbucks was with you",
    "isHighlight": false
  },
  {
    "id": "50",
    "title": "Darkest day (1)",
    "date": "",
    "description": "I wish I hadn't cancelled the hotel plans we had for this day. I am sorry love (2) It was all my fault. Had we not cancelled the plans, tu swimming nhi jaata. I was so worried sick when you got sick, but you never show your troubles as serious as they are. You always try to show you're fine even if you are internally in a lot of pain. Why aaru cat (2)\n\nI remember coming to sac bringing glucose to you understanding the only 2-3 words you typed. I was so worried that time like what just happened to him.\n\nCongrats, you finished null in the race, but at what cost (2)\nYou are such an innocent baby, you totally did not deserve this. All you did was decided to enthusiastically participate in a race, you shouldn't be punished for that. But life is unfair sometimes.\n\nI am sorry you had to go through so much pain and stress (2)\nLook how innocently you are showing me your goggles in this picture",
    "isHighlight": false
  },
  {
    "id": "51",
    "title": "Darkest day (2)",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "53",
    "title": "Darkest day (3) and more..",
    "date": "",
    "description": "",
    "isHighlight": false
  },
  {
    "id": "55",
    "title": "The day you came back",
    "date": "",
    "description": "This airport pickup after you came back from Bangalore was the best. I felt like finally after 16 days of not being able to meet you, I have my whole world back with me again.\n\nWhen you left Delhi, all we could do was say bye to each other at the hospital. I wanted to huggie you so much while saying bye, because I didn't want you to go this way. You had been sick and here I have cried whole week and you leave me without a goodbye huggie (2). Not fair at all\n\nBut when you came back, I was relieved. It felt like life is restored back to normal. I was so excited to meet you at the airport.\n\nIf I could, I would never let you fall sick again (3)\nI love you aaru cat, pls never scare me like this again. I couldn't stand the thought of being for even a few days in a world without you. My world does revolve around you, and there is nothing I'd like to change about it (2)",
    "isHighlight": false
  },
  {
    "id": "56",
    "title": "The Hotel after you came back",
    "date": "",
    "description": "null Nov 2023\n\nWe went to Park inn after our majors got over. You got me the cutest gifts that I wasn't even expecting. You get me so many random gifts that I adore and cherish, more than the gift itself, it's your intention and feelings that I feel overwhelmed by. Thank you so much for the osum necklace!\n\nPs: also thanks for giving me my new year's gift and giving me the complete gift set. I am sorry, I couldn't give you as many gifts as you have given me. Your gifts have always been so thoughtful. Can't list them all as there are so many, but wanted to let you know that there is a shelf in my cupboard at hostek that is solely dedicated to all the big and small things you have given me so far. Whenever I am sad, I just take my billu and that pillow with our photo, and I hug it and cry missing you.\n\nThank you for all of these, and I'm sorry I couldn't do as much as I should've. I will try to make up for it in the future\n\n\n\nMy love for you is everlasting and fresh as these roses",
    "isHighlight": false
  },
  {
    "id": "57",
    "title": "The day you told your mom...",
    "date": "",
    "description": "null Dec 2023\n\nI am sorry for this day Aaru, sorry that I pressurized you, I had no idea. I just thought that like I feel nice and free after telling my mom, you would too. I am sorry you had to tell them before you wanted to, before you were ready. That is why, one of my promises is to never pressurize you again for anything.\n\nBut for me, this day was one of the happiest ones, because you telling your parents about me meant a lot to me (I mean ateast I got excited thinking tera man tha isliye tune bataya, what happened after that is a different story). But till the time I was under the impression that you yourself told them about me because you wanted to, I was happy, because it felt like having your validation, it fekt like I mean something big to you that you tell your family about me. But I'm sorry you had to do all this under my pressure.\n\nI love you my family, and I'm sorry for the way I made you feel (3)",
    "isHighlight": false
  },
  {
    "id": "58",
    "title": "The Letter I Wanted to Write",
    "date": "",
    "description": "I am sorry, I didn't write this letter in time. But here is all that I wanted to write:\nDear Aaru,\nMy world revolves around you, and there Is absolutely nothing I would do to change anything about it.\n\nIn fact, I don't even have a world apart from you anymore. The statement should rather be, \"you are my world\". I am happy I feel this way for you. No matter how many fights happen, and how frustrated I become that this feeling isn't mutual, I still can't just do things to seek a revenge. I have tried it many times, whenever I say stuff like now \"I'll go out with others, make plans with them\", I already know that I'm lying, I won't. That is because we do things that we like, and I can't do something that I don't like just to seek a revenge from you. People are different, I am sorry I always tried to pressurize you with my over expectations to feel things etc. I am so sorry; you have left so many things you have wanted to do. I am sorry I have become a person in your life you feel constrained by, controlled by. I never wanted to become that. I apologize for all those cricket events, monopoly nights, for all those cancelled plans with Viraj, for that CSE trip, for all the times you had to stay idle in hostel even if I am not there because of my behavior. I am sorry for Optiver, I am sorry you got something beneath what you deserved. I am sorry that I am such a woman in your life that you feel the need to ask me for permissions to go out, when really it should be only your choice. I am sorry, I will try to make things better in your life.\n\nI am sorry for talking in bad ways about your parents. I shouldn't have crossed my boundaries, it was not correct on any level. I am sorry I diverted my anger towards them, I am sorry I become the \"crazy\" person you call me whenever I am angry. I will try to improve my anger management techniques so that I don't cross more lines. I am sorry I started diverting my anger towards your cute innocent family. Please forgive me.\n\nI am sorry for all those times I said those horrible words to you. Wish I could time travel and take them all back. I love you so much, that even if null of my horrible words ever came true, my whole world would crash down and fall apart in a second. I am sorry, I will try to control my words more. I will hurt you less with my words and not behave as a third-class citizen.\n\nI am sorry If I ever tarnished your image in any manner. It wasn't my intention to; I am just terrible at my anger management.\nWhen you fell sick, I realized what you mean to me in my life. You know we only realize the worth of a person when we feel we're about to lose them, or when they are not around. This is what happened when you were hospitalized. I didn't even think it could hit me this much. Till that day, I really didn't know that this is how much I love you. I prayed for you every day, I couldn't stay away from you even though I wasn't allowed to meet you for more than io minutes in a day. I didn't wanna be in a world where my Aaru wasn't, I didn't wanna be in campus or anywhere near the public. And you know, that's why I mean it when I say \"my world revolves around you\". During those 7 days, you and only you were the one thing on my mind 24x7. I am sorry I blame you for those quiz etc., but in reality idc about that quiz, I only say that stuff when I am angry and when you blame me for something academics related I don't wanna admit it, so I try to use this as a defense, as a way of my revenge. The truth is, I don't care about that stuff at all, and I have decided I will not blame you for anything which you aren't even the cause for. I shouldn't blame you just for a stupid revenge, I will grow up and become more mature. I would've missed one whole semester if need be, idc about it. You mean more to me than my academics and career and yeah Ik internally you would be like \"why is she doing this and why is she saying this stuff when it shouldn't be this way\" but honestly, this is what it is. I love you more than all other things, and given any option blindfolded between family and anything else, I won't even look at the other option and choose the family button. You are my family too. Idc If you think it's stupid of me to prioritize you over career, but I am this way, and there is nothing I wanna change about it. I love you, unconditionally, above every other thing in my life. I feel lucky that I have someone like you who's presence lights up my world. I am still the same level of excited everyday looking forward to our meeting time. I still look forward to our hotel trips, our date nights, movie nights, monopoly game, everyday gcl meetup etc. In the end I'll just say this : \"My world revolves around you, and there Is absolutely nothing I would do to change anything about it\"",
    "isHighlight": false
  },
  {
    "id": "59",
    "title": "Promises to make your life",
    "date": "",
    "description": "better...\nI know, I haven't been anything close to an ideal girlfriend. But I have decided to change it for better. I want to be someone you feel free with, and even if you can't feel what I feel for you, I always want to make you happier. I want to be able to give you all that you have ever wanted: the trips, the adventure, the friend circle, the sports, the networking, the game nights, your zpl auctions, dinner outings with your friends, internship parties with them, your career opportunities like Optiver, your MBA plans for USA. Here are my promises to you for the rest of our lives:\nI. I will not be the one you need to ask for permission before you go out or make plans. I will never make you feel so controlled and tied again. I am sorry for the past; I wish I could undo all those times you stayed/didn't do something you wanted to because of me. I am sorry, I didn't let you go on your CSE trip. I am sorry, you haven't had as many game nights with your friends as you could have had because of me. I am sorry that you had to cancel your dinner plans with Viraj so many times because of me. I am sorry you couldn't play sports as often as you wanted to. I am sorry about gym too. I am sorry you couldn't attend the auctions you wanted to. I am sorry for all the other things I might've missed out mentioning here, the list is pretty long and will go on and on so let's pause it here.\n2. I will not pressurize you for anything; I am sorry, you felt the pressure by me to tell your family about us. I didn't mean to, there is no point of you doing things under pressure, those things will only make u hate me more. Forgive me Aaru for pressurizing you. I promise to never blackmail you/pressurize you for anything. I will never threaten you or emotionally blackmail you to get things done my way. I am sorry for being a dictator in your life. I won't be a dictator or that blackmailing threatening pressurizing person anymore. I am very sorry.\n3. I will never say a word to disrespect your parents in any way. I will try to control as much as possible, and incase you see me about to break my\npromise, please remind me once, or huggie me once, and I'll stop (like in that movie, where the robot would give a hug to Aaru and Aaru would calm down immediately). I am sorry for all those terrible things I have said in the past, but I've decided to change this for good. (ps: this doesn't mean that you have to be open to me about your family, I understand what wrong I have done, and I don't expect you to be much open with me about your family, and that's okay, I understand, it's my fault)\n4. I promise to be there by your side always, in your happiness, and even more if you're ever sad (I hope you never get sad). Don't get me wrong, not as a burden. I will be there whenever YOU need me, and whenever I am not s person causing more stress to you in your sad times or reducing your happiness. I will hold your hand in every crisis you face. I will be there when you're sick, I'll be there when you're sad. I will make sure you don't feel alone in any times of sadness. If I ever become your partner, I promise to be your partner in every situation, be it a happy or a sad one, whether I like it or not. I'll be there with you even if the whole world turns against you\n5. I'll never make you compromise another career opportunity because of me. Wherever you go, I'll miss you incredibly, but I will never let that become a reason I stop you from going. You're like a little free bird who should be allowed to explore as much as he wishes. I am sorry for the opportunity you lost at Optiver. If I could, I would go back in time and change things. I would let you go to Amsterdam, explore Europe more, rather than tie you here with me in India. Sorry for your loss.\n6. I will not lie to you unless it's for planning your gift or for something about your welfare (I do understand what is good and bad for you and us). In the exception of these 2 cases I might have to lie for some cover or some greater good, but otherwise I won't. In these 2 cases also, I'll try to minimize the lies as much as possible.\n7. I will not stretch any fight for more than 2 days. After 2 days, no matter what the situation is, I'll try to come back to normal and also bring back things to\nnormal.\n8. I will not make any bad brain comments. I never meant any of them. Bas gusse mein nikal jaata tha. But in reality toh on some levels I'm jealous of the natural intelligence you have, I wish I had some of it. I admire you for your brains. I am sorry for the hurtful things I've said in the past. I will improve.\n9. I will love you till whenever I can. I don't know what happens in the world beyond the earth, but maybe there is a sky from where all the people we have lost in past watch us and love us. If ever an alien takes me to that sky and you're on earth, I want to tell you that I'll be sending you my love from that starry sky. I would want you to be happy with or without me, so as a loving gesture to me, I would want you to find a companion or a partner. It won't be like replacing me, because you have a right to be happy and have a partner with whom you have a loving relationship, you have a right to have a partner to support you in times of your happiness and sadness, you deserve someone to share yourself with, your feelings with. So please never feel guilty about finding someone else if an alien ever abducts me. It's not gonna be wrong. You wouldn't have ever let me finish speaking the last point, that's why I wrote it down here, hoping you'll preserve this diary of memories till late future and someday when you read this, you'll understand it too.\n\nI hope I haven't bored you a lot. Every page of writing this has been an overwhelming emotion for me. You always think of me as someone who's not into\nthis kind of stuff, right? Bcoz I would want to get back to my \"maggupana\" as u call it. Guess what? I enjoyed making this so much for you, that before my quiz days and on the day of quizzes as well, I wrote entries of this diary. Suddenly, I would remember a memory, and I would mentally go back to that day, and then I would find the pictures and make this diary. I hope you can see what you mean to me. Kabhi meri nazar se khud ko dekh, tab pata chalega what you mean to me, what is your value in my life.\n\nThere is not another person in this world I can ever replace you with. There is nothing I would choose over just sitting with you silently in your company. I am like your little pet who loves to be around its owner, and I become happy when the owner plays with me or entertains me. I am like that happy cat whenever you're around.\n\nSometimes when you are working, I would just look at you and think about you. How did I land up this piece of gold? I just keep staring at you, admiring you for the all-rounder personality you have: a package of everything, he is smart, plays sports, looks sexy and cute, has a big social life, excels at academics, has already offer from a top tier company, respects parents, doesn't ever indulge in bad habits. You are an all-rounder and I admire and love you for that. I wish sometimes you had gotten someone much better than me, someone who is like your type and isn't as boring as me, someone who loves adventure, exploring and traveling. I am sorry that you are the settler in this relationship. I am the Reacher, I got lucky getting someone way out of my league.\n\nThank you for staying with me and spending the time null wanted to spend on other things with me. You have been like a baby-sitter to me, not leaving me alone, I appreciate it a lot. But now this baby has grown and has learnt how to live a normal life. I am sorry I made you lose these last 7 semesters when you could have been building your networks with others. Thank you doing so much for me, even though I deserved none of it.\n\nLastly, I want to tell you one thing. Every word, every sentence I have written in this journal is written from the bottom of my heart. Nothing is a lie, I mean every word of it all.\n\nI love you Aaru, thank you for existing in my life (from your Prissy)",
    "isHighlight": false
  },
  {
    "id": "60",
    "title": "Thank You ...",
    "date": "",
    "description": "Thank you, for, where do I even begin from? The list is so long, I can go on and on and on\n\nThank you for spending time with me, I don't know how alone I would be had I not met you. You sacrifice things you like just to spend time with me so that I don't feel alone, thank you Aryan. I notice everything you do for me; nothing goes unnoticed.\n\nThank you for sleeping with me on VC's with lights on whenever I feel alone, Thank you for coming to the hospitals with me at the cost of missing your class and cricket match. Thank you for taking care of me when I tell you that I feel low. Thank you for bringing food for me, thank you for giving me chocolates, thank you for Billu, the necklaces, the ring, the miniso, the pillow, the heart shaped chocolate, the keychain, the ear dopes, the massager, all the birthday videos, they are the cutest.\n\nThank you for spending new years with me, for giving me your jackets when I am cold, for taking my legs and massaging them, Thank you for coming to restaurants that serve food items that I like a lot, but you don't. Thank you for pretending you don't feel cold so that I can have your jackets without guilt. Thank you for agreeing to order food even if you feel it's too soon.\n\nThank you for making me feel that I have someone in this campus and I'm not a total loner. Thank you for accompanying me in GCL till 5 AM just because my syllabus wasn't complete.\n\nThank you for Poha dates. Thank you for clicking photos of us, because of which I could find so many memories to make this diary. Thank you for movie dates, dinner dates, and hotel memories.\n\nThank you, for trying to hide all thoughts about the million other things you want to do, because you wanted us to not breakup. Thank you for making my college life beautiful. You were all that I needed here, even though I wasn't enough for you. I wish I was, but maybe in one of our next lives, I'll be enough for you. Thank you for existing in my life, and making me realize what Love is. I mean it when I say \"Tu hai toh mujhe phir aur kya chahiye\"\n\nnull",
    "isHighlight": false
  },
  {
    "id": "61",
    "title": "A song dedicated to you...",
    "date": "",
    "description": "I want to dedicate a song to you, and I mean each word of the following lyrics:\nBadle Tere Maahi\nLaake Jo Koyi Saari\nDuniya Bhi Dede Agar Toh\nKise Duniya Chahiye\nTu Hai Toh Mujhe\nPhir Aur Kya Chahiye\nTu Hai Toh Mujhe\nPhir Aur Kya Chahiye\nSunn Haaniye Jind Jaaniye\nSau Baar Janam Loon Toh Bhi\nTu Hi Humdum Har Dafa Chahiye\nTu Hai Toh Mujhe\nPhir Aur Kya Chahiye\nTu Hai Toh Mujhe\nPhir Aur Kya Chahiye\n\nSuch beautiful lyrics, even though you would be able to understand this much Hindi, still just want to tell you what it means:\n\nIf anyone offered me the whole world in exchange for you, I would reject the whole world. Because if I have you, who needs the world anyways? Tu hai toh mujhe phir aur kya chahiye. Even in ioo other lives I might have, I would want to be with you in each and every one of them.\n\nThat's what you mean to me Aryan. Tere alava nhi chahiye kuch bhi...\nHappiest null Aaru, I hope you get to explore everything you've ever wanted\n\nnull\n.",
    "isHighlight": false
  },
  {
    "id": "2",
    "title": "The day it all started... null Sept 2020",
    "date": "2020-09-27",
    "description": "When did it all really start, if you ask me, was our JEE Advanced paper. Why? For us to ever start, you should have made it to IIT Delhi. Had those guys corrected the answer key for that question from the Electrostatics topic, you would have been in IIT Bombay. Do you know, how grateful I'm that they didn't correct it? So, my first thanks is for those JEE Advanced guys who made us possible (even though they have no idea about it lol).\n\nI know, you were sad about it, but I like to think of it as the butterfly effect (the sensitive dependence on initial conditions in which a small change in one state of a deterministic nonlinear system can result in large differences in a later state, source: Wikipedia). The result of that one single question is what we have today, isn't that beautiful?\n\nHere is your fav question (and now mine too)\nTwo identical non-conducting solid spheres of same mass and charge are suspended in air from a common point by two non-conducting, massless strings of same length. At equilibrium, the angle between the strings is null. The spheres are now immersed in a dielectric liquid of density null and dielectric constant 21 . If the angle between the strings remains the same after the immersion, then\n(A) electric force between the spheres remains unchanged\n(B) electric force between the spheres reduces\n(C) mass density of the spheres is null\n(D) the tension in the strings holding the spheres remains unchanged",
    "isHighlight": false
  },
  {
    "id": "3",
    "title": "The day it actually started (1)...",
    "date": "2020-12-12",
    "description": "null Dec 2020\n\"Hi I'm Aryan Dua from IITD, looking forward to socialize\"\nThe very first text exchanged between us ever was on Instagram. You saw my post on insta freshers page and messaged me.. do u know, I was actually very shy and was pretty much not gonna have that post on freshers page, but Smrati kind of pushed me to. But you know, I like to believe that even if I hadn't had that post, we would still have reached where we are today; maybe not via Instagram, but some other way.. I think, we were always meant to be null.\n\nIt is sad that Instagram deletes very old messages.. I wanted to take a screenshot of that message and put it here, I am sorry, I never took one null\n\nPS: this date I remember is pure memory. I couldn't even find the message, so date toh kese hi milti",
    "isHighlight": false
  },
  {
    "id": "4",
    "title": "The day it actually started (2)... null March 2021",
    "date": "2021-03-04",
    "description": "Let's be honest, we both know we didn't have a \"specific\" start date. I think these kinds of romances are the best ones: both of you don't need a formal verbal agreement to state that yes you are dating, but rather, there is so much mutual connection and understanding that both of you just know that you are. But fir bhi, for the sake of having an anniversary (so that we keep the celebrations of love alive between us always), we decided that null March is gonna be the day. Do you remember why? I do... This was the first time you asked me \"hey prissssy will u be my missy\". And even though I said yes and asked u are we official now, you said \"abhi nhi, majors ke baad\". Average depc maggu boy",
    "isHighlight": false
  },
  {
    "id": "5",
    "title": "The day it actually started (3)... null March 2021",
    "date": "2021-03-07",
    "description": "When we were discussing about what should we keep our anniversary date as, this was another date that we had in mind. Do you remember what happened on null March? We both had an extremely long VC (Those online covid times, and uff your rules, you would only have late night vc's on Saturday nights, null March was also a Saturday night). You remember our vc's (or lets say, silent vc's). How we would chat and not speak a word, coz if we did, we would wake up others. We would smile and watch each other, and all the time talk on text. This was our own unique way I guess, very different from all others. The words you said to me on that day which I can never forget were \"too much crush on Prisha and \"I like u\". My heart must've skipped a beat when I heard these words, and I remember\nhow much happy I was internally, that feeling of fresh love, I wish I could relive that moment again",
    "isHighlight": false
  },
  {
    "id": "6",
    "title": "First fight, First I love You null May 2021",
    "date": "2021-05-28",
    "description": "Do you remember the first time you said I love null to me? We had our first fight, which I don't even remember about now. All that I remember about that day is the first I love you... You think I only remember our fights ? Baby, if that was the case, 3 years down the line, I wouldn't have remembered our first I love you, but would've remembered the details of that fight.\n\nDo you know when did I start using saved messages feature in telegram? The first saved message there is \"I love u\"- forwarded from Aryan (IITD)",
    "isHighlight": false
  },
  {
    "id": "8",
    "title": "The first offline real meet...",
    "date": "2021-08-16",
    "description": "null August\n\n2021\n\nThe surprise you gave me, OMG!! I couldn't believe that this was actually happening! You remember how I kind of had a crazy intuition that you're coming to Delhi? I actually searched for flights that day (Pune to Delhi). When I found my intuition was correct I kind of started believing we do have a connection from heart.\n\n\nHow crazy that day was!! I even remember the clothes I wore the first time to meet you: a red colour top. Seeing you for the first time irl, my first thought: he is taller that I thought.. his voice is so different.. here is our first ever photo:",
    "isHighlight": false
  },
  {
    "id": "9",
    "title": "Our first Date...",
    "date": "2021-08-17",
    "description": "null August\n\n2021\n\nThe day I was super excited for!! I took permissions for this day even before you confirmed to me that you actually were in Delhi, before your flight could even land, I made plans!! We spent the whole day together!! First, we had our lunch at\nGreen park (Dominos). Oh wait, no, first we took our very iconic pic.. The one near the Hauz Khas metro station\n\n\nThen we came back to campus and met a few people. After that we went to that kind of hill top near back of Kailash, and sat against the tree.. We had an amazing time there, no? null null",
    "isHighlight": false
  },
  {
    "id": "10",
    "title": "My first birthday with you (Virtual)",
    "date": "2021-10-05",
    "description": "null October 2021\n\nI remember you had so pure intentions that day, you tried to stay up till late for\nme and by chance fell asleep.. I know baby, you didn't do it intentionally.. and when you woke up, it was 5:50 in the morning. Yeah I know sometimes your sleeping can be annoying but tbh, you seem like a real cute innocent baby who is sleeping.. I LOVE YOU SO MUCH.. You look SO CUTE while sleeping though, just wanna huggie you always..\n\nThe day before that, you also sent me an icecream ; my favourite flavour, vanilla (I'm a basic bitch no?). We had a vc, and I ate my icecream with you on that vc. Do you know, I was secretly kind of still hoping you would come and surprise me again like you did in August? Silly me",
    "isHighlight": false
  },
  {
    "id": "19",
    "title": "null March 2022",
    "date": "2022-03-15",
    "description": "Initially we had plans to go to cyberhub, but then this whole hurting the thing happened and we had to delay it. The day I came back to campus, even though I couldn't walk properly for long stretches of time, I still was so excited to go with you that I went even with a lot of ache.\n\nAur humne vaha jaake kya kiya? Fastfood chains se khaya (1) (1) MCD, pizza hut etc.",
    "isHighlight": false
  },
  {
    "id": "23",
    "title": "null April 2022",
    "date": "2022-04-29",
    "description": "The first time we did anything like a ball dance was this day. Isha and other girls group around us called us very cute. It was I think Sunidhi chauhan's concert and she was singing some romantic songs.\n\nI have a very cute picture that I put up as a story that day\n\n\nHow cute is this no??",
    "isHighlight": false
  },
  {
    "id": "28",
    "title": "null June 2022",
    "date": "2022-06-17",
    "description": "We never had a domestic trip; our biggest flex is our first trip together was international Supercool right? The place we first visited together was Berlin. I was so excited getting off that train ready to see you at the railway station.. We were out late night roaming the streets of Berlin, searching for food. We did boating, visited so many places. This is also where your famous \"Mujhe kya mein toh pattagobhi hu\" picture was captured",
    "isHighlight": false
  },
  {
    "id": "32",
    "title": "null Sept 2022",
    "date": "2022-09-11",
    "description": "You may find it weird that I mentioned this but ab kya kare, hum dono hi foodie hai. Our life and dates are incomplete without food. So going for the first time to such a mehnga place is an imp memory. You gave me this party when you got your internship fixed at Ripik.\n\nKya kiya humne vaha jaake? Ice cream mix (1) (1)\n\n\nPs: A picture of me trying to eat my fav snack",
    "isHighlight": false
  },
  {
    "id": "35",
    "title": "null Dec 2022",
    "date": "2022-12-04",
    "description": "This is about the first time you gave me a rose. We have a very very cute picture that we took that day. I had been cribbing since a long time about how you have never given me a rose etc etc. And since that day, the roses haven't stopped. You have gotten me a rose so mahy times since then.. A bunch of roses too.. I never throw them away. I cherish them so much that I try to keep them fresh for as long as possible by keeping them in water because it's a gift from null to me and I never want it to die.",
    "isHighlight": false
  },
  {
    "id": "40",
    "title": "null Feb 2023",
    "date": "2023-02-18",
    "description": "You remember when was the first time we went to this place? To celebrate our valentine's day. We hadn't had a proper celebration on null February because again, we were fighting over something.\n\nBut since we both can't have any celebration without food in it, what is the perfect way to celebrate valentine's? Go to a place with vibe that serves good food!\n\nPS: Also the day I tried my first ever waffle and we discovered the concept of eggless waffles. Uske baad se toh waffles became an essential part of life too\n\nPps: How many new food items and places have I discovered with you? Tacobell, Nachos, Bruschetta, waffles, pancakes, thai curry, wok, subway cookie. You have made me a foodie.\n\nPpps: Remember 500 ka bruschetta? And how we laughed at it ki ye, ye hai 500 ka item?",
    "isHighlight": false
  },
  {
    "id": "43",
    "title": "null April 2023",
    "date": "2023-04-01",
    "description": "Thank you for supporting me so much in conducting the quizzing event. The perfect quiz master. Thank you for handling things so perfectly and smoothly even though you had your own assignments and deadlines. It was because of you that I could go to Hyderabad tension free. I knew that Aryan would handle everything.\n\nI loved the fact that we conducted, organized, and hosted this event together. Thank you for joining NSS with me. You made my NSS experience ioo times better than it would have been without you. I enjoyed going for long meetings because you would be there too, and I wouldn't be away from you.\n\n\nBest quiz master",
    "isHighlight": false
  },
  {
    "id": "52",
    "title": "null Oct 2023",
    "date": "2023-10-15",
    "description": "You don't even know how sad I am while writing all this, almost crying thinking about what happened to you (2) (2)\n\nI brought you a care package made out of love, because I wanted you to recover asap, I am sorry I got it so late after your consultation was over, I really am sorry. I realize it must've been very painful to wait for those medicines (3) (3)\n\nI am sorry I gave you the advice to eat ibuprofen, I am sorry love, I am so so sorry I caused you all this trouble null 5null\\null (5) null 5$ (5).\n\nI remember trying to feed you rice and dahi, but all you drank was a glass of juice, Then we took you to the hospital where they gave you another 2 injections of painkiller which might've worsened your condition even more (2)\n\nDo you remember raat ko I tried to make you eat khichdi? We ordered khichdi for you, you didn't eat a lot of that, hardly 5-6 spoons. ALL OF IT I had to finish jabki bimar toh tu tha (3) (3)\n\nAur tune kya khaya tha? Pizza. Is that what patients and sick people eat, batao cat g?? (3) (3)\n\nI LOVE YOU a lot, please never get this sick again, there are people who cry thinking about the thought of you being sick, please don't hurt those people again (2) (2)",
    "isHighlight": false
  },
  {
    "id": "54",
    "title": "null Oct 2023",
    "date": "2023-10-16",
    "description": "Took you to the hospital forcefully, little did I know it would turn out to be something so serious that in less than 12 hrs of your OPD consultation you would be admitted to the ICU. I tried to snatch that phone away from you because the doctor told me to, otherwise he would stress out over his condition. You know, I cried when I went out to ask doc about your status. I asked her \" theek toh ho jayega na\" and doctor said \" we are trying our best, nothing more can be said\". I couldn't even cry infront of you. That was the hardest part.\n\nI waited 3 continuous days to receive any good news, but no, your creatinine levels were at a constant rise with no signs of improvement. The day I felt a little relieved was after your dialysis when they started dropping.\n\nI came to visit you everyday, not because null asked me to, or that I was needed. I came there because I needed to see you everyday. I couldn't be in public in campus, it just felt like \"look at how the world is operating still in the same way, as if nothing has happened\" when actually a lot had. I hated that world, the world which was normal without my Aaru in it. It wasn't a normal world for me. All I wanted 24x7 was to be with you beside your bed in the hospital, holding your hand and sleeping with you. I did not want to give a quiz, attend a class or anything else. All that mattered was you.\n\n\nThis is the picture of a shaitaan cat who was told to take steam and he fooled everyone around by pretending that the machine was on",
    "isHighlight": false
  }
]
